Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དགེ་སློང་དག་གིས་ཞུས་པ། བཙུན་པ་སེམས་ཅན་འདི་སྡུག་བསྔལ་འདི་ལས་ནམ་ཐར་པར་འགྱུར་ལགས།
en: “Lord, when will this being be liberated from his suffering?” inquired the monks.

source: བཀའ་སྩལ་པ། དགེ་སློང་དག་བསྐལ་པ་བཟང་པོ་འདི་ལ་སངས་རྒྱས་ལྔ་བརྒྱ་འབྱུང་བར་འགྱུར་ཏེདེ་རྣམས་ཀྱི་འོག་ཏུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྣང་མཛད་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Monks,” replied the Buddha, “five hundred buddhas will appear in this good eon, and after them, the totally and completely awakened Buddha Vairocana will be in the world.

source: དེའི་གསུང་རབ་ལ་འདི་དུད་འགྲོ་ལས་ཐར་ཏེ་མི་ལུས་ཐོབ་ནས་དེའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་མཚམས་མེད་པའི་ལས་བྱེད་པར་འགྱུར་རོ། །
en: It is through his teaching that this being will be liberated from rebirth as an animal and achieve a human birth. “After he goes forth in his teaching, he will commit the five heinous misdeeds.

source: དེ་དེ་ནས་ཤི་འཕོས་ཏེ་དུས་ལས་འདས་ནས་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: Then, having died, he will transmigrate and take rebirth as a hell being.

source: དེས་སེམས་ཅན་དམྱལ་བ་དེ་དག་ཏུ་ལོ་འབུམ་ཕྲག་དུ་མར་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་རོ། །
en: As a hell being he will undergo suffering for hundreds of thousands of years.

source: དེས་དེའི་ལས་མི་བཟད་པ་ཟད་ནས་ཡང་མི་ལུས་ཐོབ་པར་འགྱུར་ཏེ།
en: “Once he has exhausted those terrible acts, he will again achieve a human birth.

source: དེའི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྣང་མཛད་ཅེས་བྱ་བ་ཞིག་འཇིག་རྟེན་དུ་འབྱུང་སྟེ།
en: At that time, too, the totally and completely awakened Buddha Vairocana will be in the world.

source: དེའི་གསུང་རབ་ལ་འདི་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་ལ་དེ་ཀུན་ལ་གྲགས་ཤིང་བསོད་ནམས་ཆེན་པོ་དང་ལྡན་ཏེ། གོས་དང་ཟས་དང་མལ་ཆ་དང་སྟན་དང་ནད་གསོས་དང་སྨན་ཟོང་རྣམས་རྙེད་པར་འགྱུར་ལ་དེ་དེར་ལུང་འབོགས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་འགྱུར་ཏེ།
en: He will go forth in his teaching, cast away all afflictive emotions, and manifest arhatship. Renowned by all and possessed of great merit, he will acquire provisions such as clothes, food, bedding, a seat, and medicines for the sick. There he will become supreme among the exponents of the teachings.

source: དེས་དེར་སྐྱེ་བོ་མང་པོ་ལ་ཕན་བཏགས་ནས་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ཏེ།
en: After acting for the benefit of many, he will pass beyond all sorrow into the realm of nirvāṇa without any remainder of the aggregates.

source: དེར་འདི་ཡི་སྡུག་བསྔལ་གྱི་མཐའ་ཟད་པར་འགྱུར་རོ། །
en: Then his sufferings will come to an end.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་སྐྱོ་བ་ཆེན་པོ་སྐྱེས་སོ། །
en: As soon as they heard this, the people gathered there welled up with grief.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་གི་ཡིད་སྐྱོ་བར་གྱུར་པར་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ། དེ་ནས་སྐྱེ་བོ་མང་པོ་དེ་དག་གིས་སྟན་དེ་ལ་འཁོད་བཞིན་དུ་ཁ་ཅིག་གིས་ནི་དྲོ་བར་གྱུར་པ་བསྐྱེད་དོ། །
en: The Blessed One directly apprehended their grief, taught them the Dharma accordingly, and among the assembled some generated heat right where they sat.

source: ཁ་ཅིག་གིས་ནི་རྩེ་མོ་དང་བདེན་པ་དང་འཐུན་པའི་བཟོད་པ་དང་འཇིག་རྟེན་གྱི་ཆོས་ཀྱི་མཆོག་དང་མཐོང་བའི་སྙོམས་པར་འཇུག་པ་བསྐྱེད་དོ། །
en: Some generated the peak, or generated the patience in accord with the truths, or generated the highest worldly dharma, or generated the attainment of seeing.

source: ཁ་ཅིག་གིས་ནི་སྟོབས་ཀྱིས་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་བ་དང་།
en: some to become great universal monarchs,

source: ཁ་ཅིག་གིས་ནི་བརྒྱ་བྱིན་དུ་འགྱུར་བ་དང་།
en: some to become Indra,

source: ཁ་ཅིག་གིས་ནི་ཚངས་པར་འགྱུར་བ་དང་།
en: some to become Brahmā,

source: ཁ་ཅིག་གིས་ནི་ཉན་ཐོས་ཀྱི་བྱང་ཆུབ་དང་།
en: some for the enlightenment of the listeners,

source: ཁ་ཅིག་གིས་ནི་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་དང་ཁ་ཅིག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ས་བོན་བསྐྱེད་དོ། །
en: some for the enlightenment of the solitary buddhas, and some for unexcelled, total, and complete enlightenment.

source: འཁོར་དེ་དག་གི་ནང་ནས་ཕལ་ཆེར་ནི་སངས་རྒྱས་ལ་གཞོལ་ཆོས་ལ་འབབ་དགེ་འདུན་ལ་བབ་པར་བྱས་ཏེ་བཀོད་ནས།
en: Among the assembled, most found themselves drawn to the Buddha, intent on the Dharma, and favoring the Saṅgha.

source: བཅོམ་ལྡན་འདས་གཙུག་ལག་ཁང་དུ་གཤེགས་སོ། །
en: With this accomplished, the Blessed One returned to the monastery.

source: ལས་བརྒྱ་ཐམ་པ་ལས་སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་གཉིས་པ་རྫོགས་སྷོ།། །།
en: This concludes Part Two of The Hundred Deeds.

source: སྡོམ་ནི། ཀ་ཙང་ཀ་ལ་ཀཻ་ནེ་ཡ། བག་མ་གཏོང་གཉིས་གཅོད་པ་གཉིས། །ཟ་བ་དགའ་བྱེད་སྣག་བུ་དང་། །བུར་འདུ་ཤེས་དང་ཞིང་པ་དང་། །ཤི་དང་ཀོ་ཀ་ལི་ཀ་དང་། །ཐང་བཅད་ཐ་མ་ཁམ་ཞེས་བྱ། །
en: The Story of Kacaṅkalā 2. The Story of Kaineya 3. The Betrothal of the Bride: Two Stories 4. Cuts: Two Stories 5. Being Devoured 6. The Story of Nandaka 7. Chunks of Meat 8. The One Who Thought He Saw His Son 9. The Farmer 10. Death 11. A Story about Kokālika 12. The Tired Man 13. Morsel

source: ཀ་ཙང་ཀ་ལ་ཞེས་བྱ་བ་ནི།
en: The Story of Kacaṅkalā

source: བཅོམ་ལྡན་འདས་ཡུལ་ཨོ་ཏ་ལ་ན་ཨོ་ཏ་ལའི་ནགས་ཁྲོད་ན་བཞུགས་སོ། །
en: When the Blessed One was staying in Otalā Forest in Otalā,

source: ལྷུང་བཟེད་བསྣམས་ནས་ཡུལ་ཨོ་ཏ་ལར་བསོད་སྙོམས་ལ་གཤེགས་སོ། །
en: and, carrying his alms bowl, went for alms in the villages of Otalā.

source: དེའི་ཚེ་བུད་མེད་ཅིག་བུམ་པ་ཁྱེར་ཏེ་ཆུ་ཆུར་སོང་བ་ལས་བུད་མེད་དེས་ཐག་རིང་པོ་ཞིག་ནས།
en: At that time there was a certain woman who had taken a pot and gone out for water.

source: བཅོམ་ལྡན་འདས་མཛེས་པ། དད་པ་སྐྱེ་བར་འགྱུར་བ་དབང་པོ་ཞི་བ་ཐུགས་ཞི་བ། ཐུགས་མཆོག་ཏུ་ཞི་བ་དང་ལྡན་པ་གསེར་གྱི་མཆོད་སྡོང་བཞིན་དུ་དཔལ་དང་གཟི་བྱིན་འབར་བ་མཐོང་ངོ་། །
en: From a distance, she saw that the Blessed One was beautiful, pleasing, his senses were at peace, his heart at peace, and his mind absolutely serene. He was as shining and radiant as a golden pillar.

source: མཐོང་ནས་ཀྱང་དེ་བཅོམ་ལྡན་འདས་ལ་བུའི་འདུ་ཤེས་སྐྱེས་ནས་དེས་བུམ་པ་དེ་ཕྱོགས་གཅིག་ཏུ་བཞག་སྟེ།
en: What is more, she perceived the Blessed One to be her own son.

source: ལག་པ་གཉིས་བརྐྱང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་སྨྲས་པ་བུ་དང་ཕྲད་དོ། །
en: Laying her pot aside, she spread out her hands and approached the Blessed One, saying, “My son!

source: བུ་དང་ཕྲད་དོ་ཞེས་ཟེར་ཞིང་། བཅོམ་ལྡན་འདས་ཀྱི་མགུལ་ནས་འཁྱུད་པར་འདོད་པ་ལས་དགེ་སློང་རྣམས་ཀྱིས་མཐོང་ནས་བཀག་གོ། །
en: My son!” But as she went to take the Blessed One in her arms, the monks hindered her from doing so.

source: དེ་ནས་དེར་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: The Blessed One corrected the monks, saying,

source: དགེ་སློང་དག་བུད་མེད་འདི་མ་དགག་ཅིག །
en: “Monks, do not hinder this woman.

source: གལ་ཏེ་བུད་མེད་འདི་དེ་བཞིན་གཤེགས་པའི་མགུལ་ནས་འཁྱུད་དུ་མ་བཅུག་ན། ཁ་ནས་ཁྲག་དྲོན་མོ་སྐྱུགས་ཏེ་འཆི་བར་འགྱུར་རོ། །
en: Monks, if you don’t let this woman take the Tathāgata in her arms, she will spew warm blood from her mouth and die.”

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་དེ་ཐོས་ནས་མ་བཀག་པར་བཞག་གོ། །
en: The monks did not hinder her any further,

source: དེ་ནས་དེས་བཅོམ་ལྡན་འདས་ཀྱི་མགུལ་ནས་འཁྱུད་ནས་ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: and, after holding the Blessed One in her arms, she sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་།
en: The Blessed One directly apprehended her thoughts,

source: བག་ལ་ཉལ་དང་ཁམས་དང་རང་བཞིན་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: habitual tendencies, temperament, and nature, and taught her the Dharma accordingly.

source: དེ་ནས་བུད་མེད་དེས་སྟན་དེ་ཁོ་ན་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Hearing it, the woman destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where she sat.

source: དེས་བདེན་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Having seen the truths, she rose from her seat, drew down the right shoulder of her upper garment, bowed toward the Blessed One with palms together, and implored him,

source: བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་མའི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: “Blessed One, if permitted I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱི་ལ་གཏད་ནས། དེས་དེ་རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་བྱས་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: The Blessed One presented her to Mahā­prajāpatī Gautamī, who led her to go forth as a novice, conferred on her full ordination, and instructed her.

source: དེས་དགྲ་བཅོམ་མ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ནས། གསེར་དང་བོང་བར་མཉམ་པ། ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ།
en: As an arhat, free from the attachments of the three realms, her mind regarded gold no differently than filth, and the palms of her hands as like space itself.

source: སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་མི་ལྟ་བ།
en: She had no regard for worldly profit, passion, or acclaim.

source: དེ་ནས་དེ་བཅོམ་ལྡན་འདས་ཀྱིས་མཆོག་ཏུ་ལུང་བསྟན་ཏེ།
en: Then the Blessed One spoke of her greatness, saying,

source: དགེ་སློང་དག་ངའི་ཉན་ཐོས་ཀྱི་དགེ་སློང་མ་མདོ་རྣམ་པར་འབྱེད་པ་རྣམས་ཀྱི་མཆོག་ནི་འདི་ལྟ་སྟེ། དགེ་སློང་མ་ཀ་ཙང་ཀ་ལ་འདི་ཡིན་ནོ་ཞེས་ལུང་བསྟན་ཏོ། །
en: “Monks, this is the nun Kacaṅkalā—among my listener nuns, she is foremost of those who interpret the sūtras.”

source: དེ་ནས་དགེ་སློང་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ།
en: The monks requested the Blessed One,

source: བཙུན་པ་གཟིགས་ལགས་སམ་བུད་མེད་སྟོང་ཕྲག་དུ་མས་བཅོམ་ལྡན་འདས་མཐོང་ན་སུས་ཀྱང་བཅོམ་ལྡན་འདས་མཐོང་བ་ན་འདི་ལྟར་མ་བརྒྱུགས་ལགས་སོ། །
en: “Lord, tell us why thousands of women have seen the Blessed One, but never has anyone run to him from a distance like that.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཀ་ཙང་ཀ་ལ་འདི་ནི་ངའི་འདས་མ་ཐག་པའི་ཚེ་རབས་ལྔ་བརྒྱར་མར་གྱུར་པས་ན།
en: “Monks,” explained the Blessed One, “Kacaṅkalā was my mother for five hundred lifetimes.

source: འདི་ནི་སྔོན་གྱི་བག་ཆགས་ཀྱི་གཞི་ཡོད་པའི་ཕྱིར་ང་མཐོང་ན་རྒྱུག་གོ། །
en: She saw me and ran to me because of these habitual tendencies.”

source: བཙུན་པ་གལ་ཏེ་འདི་བཅོམ་ལྡན་འདས་ཀྱི་འདས་མ་ཐག་པའི་ཚེ་རབས་ལྔ་བརྒྱར་ཡུམ་དུ་གྱུར་པ་ལགས་ན། ཅིའི་སླད་དུ་ད་ལྟར་གྱི་ཡུམ་དུ་མ་གྱུར་ལགས།
en: “Lord, if she was the Blessed One’s mother for five hundred lifetimes, why is she not your mother now?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་རྒྱུ་གཉིས་དང་རྐྱེན་གཉིས་ཀྱིས་ན་འདི་ངའི་ད་ལྟར་གྱི་མར་མ་གྱུར་ཏེ
en: “Monks, there are two causes and two conditions for her not being my mother now,” the Blessed One replied.

source: ལྷ་མོ་སྒྱུ་འཕྲུལ་ཆེན་མོས་སྨོན་ལམ་བཏབ་སྟེ།
en: “First, Mahā­māyādevī prayed,

source: ཀྱེ་མ་བདག་སངས་རྒྱས་ཀྱི་ཡུམ་དུ་གྱུར་ཅིག་ཅེས་བྱས་པ་དེ་དང་།
en: ‘Oh, but let me become the mother of the Buddha!’

source: ང་ཡང་འདིས་ཡིད་བྱུང་བར་བྱས་ནས་ངས་ཀྱང་སྨོན་ལམ་བཏབ་སྟེ།
en: And I myself, in distress, also prayed,

source: ཕྱིན་ཅད་འདི་བདག་གི་མར་མ་གྱུར་ཅིག་ཅེས་བྱས་པའི་ཕྱིར་རོ། །
en: ‘May she who is my mother, in the future not be my mother.’ ”

source: གསོལ་པ། འདིས་ཅི་ལྟར་བཅོམ་ལྡན་འདས་ཐུགས་བྱུང་བར་བགྱིས་ལགས།
en: “What distress did she cause the Blessed One?” they asked.

source: བཀའ་སྩལ་པ། དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ངེས་པར་འབྱུང་བ་ལ་དགའ་བ་དང་སྦྱིན་པ་ལ་དགའ་བ་ཡིན་ན
en: “Monks,” the Blessed One replied, “bodhisattvas delight in renunciation and love to give,

source: འདིས་ཐམས་ཅད་དུ་ངའི་ངེས་པར་འབྱུང་བ་དང་སྦྱིན་པའི་བར་ཆད་བྱས་ཏེ་གཞི་དེས་ན་འདིས་ང་ཡིད་བྱུང་བར་བྱས་སོ། །
en: and she continually created obstacles to my renunciation and charity. This is why she caused me distress.”

source: བཙུན་པ་དགེ་སློང་མ་ཀ་ཙང་ཀ་ལས། ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས། དབུལ་མོར་གྱུར་ལ་རྒས་ནས་གདོད་རབ་ཏུ་བྱུང་ལགས།
en: “Lord, what action did the nun Kacaṅkalā take that ripened into her first being poor and then going forth only in her old age?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ངེས་པར་འབྱུང་བ་ལ་དགའ་བ་དང་སྦྱིན་པ་ལ་དགའ་བ་ཡིན་ན
en: “Bodhisattvas delight in renunciation and love to give,” the Blessed One explained,

source: འདིས་ངའི་ཚེ་རབས་བགྲངས་པར་ངེས་པར་འབྱུང་བ་དང་སྦྱིན་པའི་བར་ཆད་བྱས་པས་ན།
en: “and for a certain number of my lives she obstructed my renunciation and charity.

source: ལས་དེའི་རྣམ་པར་སྨིན་པས་ད་ལྟར་དབུལ་མོར་གྱུར་ལ་རྒས་ནས་གདོད་རབ་ཏུ་བྱུང་ངོ་། །
en: That act ripened into her now being poor, and going forth only in her old age.”

source: བཙུན་པ་དགེ་སློང་མ་ཀ་ཙང་ཀ་ལས། ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ད་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་མདོ་རྣམ་པར་འབྱེད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ལ།
en: “Lord, what action did the nun Kacaṅkalā take that ripened into the Blessed One declaring her the foremost among those who interpret the sūtras,

source: འདིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེམི་མཉེས་པར་མ་བགྱིས་ལ་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་ཡང་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: and that she pleased and did not displease the Blessed One, went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?”

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks,” the Blessed One recounted, “in times past, in this fortunate eon, when people lived as long as twenty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་གསུང་རབ་ལ་འདི་རབ་ཏུ་བྱུང་ནས། གང་ལས་རབ་ཏུ་བྱུང་བའི་མཁན་མོ་དེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་མདོ་རྣམ་པར་འབྱེད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏེ།
en: she went forth in his teaching, and the totally and completely awakened Buddha Kāśyapa commended her preceptor as foremost among those who interpret the sūtras.

source: དེས་དེར་འདིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: “She practiced pure conduct all her life, and at the time of her death she prayed,

source: འདི་ལྟར་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ། ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས།
en: ‘While I may not have attained any great virtues, still I have gone forth in the teaching of the totally and completely awakened Buddha Kāśyapa and practiced pure conduct all my life.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བདག་གི་མཁན་མོ་ཇི་ལྟར་མདོ་རྣམ་པར་འབྱེད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་བཞིན་དུ། བདག་ཀྱང་ཤཱཀྱ་ཐུབ་པ་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་དེས་མདོ་རྣམ་པར་འབྱེད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པར་ཤོག་ཅིག་ཅེས་བྱས་སོ། །
en: Just as he commended my preceptor as foremost among those who interpret the sūtras, may the peerless Śākyamuni, King of the Śākyas, likewise commend me as foremost among those who interpret the sūtras.’

source: དེའི་ཚེ་དགེ་སློང་མར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཀ་ཙང་ཀ་ལ་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was that nun then is none other than Kacaṅkalā now.

source: དེར་འདིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: At that time she practiced pure conduct all her life, and at the time of her death she prayed,

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བདག་གི་མཁན་མོ་ཇི་ལྟར་མདོ་རྣམ་པར་འབྱེད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་བཞིན་དུ། བདག་ཀྱང་ཤཱཀྱ་ཐུབ་པ་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་དེས་མདོ་རྣམ་པར་འབྱེད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པར་ཤོག་ཅིག་ཅེས་བྱས་པ་དེས་ན།
en: Just as he commended my preceptor as foremost among those who interpret the sūtras, may the peerless Śākyamuni, King of the Śākyas, likewise commend me as foremost among those who interpret the sūtras.’

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་ནས།
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ།
en: that she has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions,

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས་ངས་འདི་མདོ་རྣམ་པར་འབྱེད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་ཡང་བསྟན་ཏོ།། །།
en: and manifested arhatship, and that I commended her as foremost among those who interpret the sūtras.”

source: ཀཻ་ནེ་ཡ་ཞེས་བྱ་བ་ནི།
en: The Story of Kaineya

source: བཅོམ་ལྡན་འདས་ཡུལ་ཨ་དུ་མ་ན་འབྱུང་པོའི་ཁྱིམ་ཞེས་བྱ་བའི་གནས་ན་བཞུགས་སོ། །
en: When the Blessed One was staying at the Domicile of Ghosts in the Adumā region,

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ཏེ་ལྷུང་བཟེད་བསྣམས་ནས། ཡུལ་ཨ་དུ་མའི་གྲོང་དུ་བསོད་སྙོམས་ལ་གཤེགས་སོ། །
en: one morning he donned his lower garment and Dharma robes, and, carrying his alms bowl, went for alms in Adumā village.

source: ཨ་དུ་མའི་གྲོང་དུ་བསོད་སྙོམས་མཛད་ནས། བཤོས་གསོལ་ཏེ། ཟས་ཕྱིས་ལེན་པ་སྤངས་ནས་འབྱུང་པོའི་ཁྱིམ་གྱི་གནས་ཀྱི་ཕྱི་རོལ་དུ་ཞབས་བཀྲུས་ཏེ་ནང་དུ་ཡང་དག་འཇོག་གི་ཕྱིར་འབྱུང་པོའི་ཁྱིམ་གྱི་གནས་ཀྱི་ནང་དུ་གཤེགས་སོ། །
en: After receiving his alms in Adumā village, he ate his meal, and since he no longer took food in the later part of the day, he washed his feet outside the Domicile of Ghosts, and entered the grounds to meditate.

source: དེའི་ཚེ་ཡུལ་ཨ་དུ་མར་འབྲུག་སྒྲ་ཡང་བྱུང་ཐོག་ཀྱང་བབ་སྟེ།
en: In the meantime there was a thunderstorm, and lightning struck in Adumā.

source: གླང་བཞི་དང་ཁྱིམ་བདག་ཞིང་པ་སྤུན་གཉིས་བསད་ནས། དེར་སྐྱེ་བོ་ཕལ་པོ་ཆེས་སྒྲ་བོ་ཆེ་དང་ཅ་ཅོ་ཆེན་པོའི་སྐད་ཕྱུང་ངོ་། །
en: The people there were chattering anxiously about how it killed four bulls and two brothers: one a householder, the other a peasant farmer.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཕྱེ་མ་རེད་ཀྱི་དུས་སུ་ནང་དུ་ཡང་དག་འཇོག་ལས་བཞེངས་ནས་འབྱུང་པོའི་ཁྱིམ་གྱི་གནས་ནས་བྱུང་སྟེ། འབྱུང་པོའི་ཁྱིམ་གྱི་གནས་ཀྱི་གྲིབ་མའི་ཐང་གི་འཆག་ས་ན་འཆག་ཅིང་བཞུགས་སོ། །
en: As evening fell, the Blessed One rose from his meditation and emerged from the Domicile of Ghosts and lingered there, walking among the shadows on the grounds of the Domicile of Ghosts.

source: དེ་ནས་དེར་མི་ཞིག་ཀྱང་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་གི་ནང་ནས་བྱུང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་འཆག་པའི་སླད་བཞིན་དུ་འབྲང་ཞིང་འཆག་གོ། །
en: Thereupon one of the great many people there got up and walked toward the Blessed One. After approaching him, he touched his head to the Blessed One’s feet and fell in behind him, that he might also walk where the Blessed One had walked.

source: དེ་ནས་དེར་བཅོམ་ལྡན་འདས་ཀྱིས་མི་དེ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One asked the man,

source: ཀྭའི་མི་འདི་ཨ་དུ་མའི་གྲོང་ཁྱེར་དུ་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་སྒྲ་བོ་ཆེ་དང་ཅ་ཅོ་ཆེན་པོའི་སྐད་གྲགས་པ་དེ་ཅི་ཞིག །
en: “My friend! What are the people of Adumā village chattering about so anxiously?”

source: མི་དེས་གསོལ་པ། བཙུན་པ་ད་གདོད་ཨ་དུ་མའི་གྲོང་དུ་འབྲུག་སྒྲ་ཡང་བྱུང་ཐོག་ཀྱང་བབ་སྟེ
en: “Lord,” said the man, “there was a thunderstorm, and lightning struck in Adumā.

source: གླང་བཞི་དང་ཁྱིམ་བདག་ཞིང་པ་སྤུན་གཉིས་བཀུམ་ནས་དེར་སྐྱེ་བོ་ཕལ་པོ་ཆེས་སྒྲ་བོ་ཆེ་དང་ཅ་ཅོ་ཆེན་པོའི་སྐད་ཕྱུང་ན།
en: Everyone is chattering anxiously about how it killed four bulls and two brothers: one a householder, the other a peasant farmer.

source: ཅི་བཅོམ་ལྡན་འདས་ཀྱིས་འབྲུག་སྒྲ་དང་ཐོག་བབ་པའི་སྒྲ་མ་གསན་ཏམ།
en: Did the Blessed One not hear the thunder roar and the lightning strike?”

source: བཀའ་སྩལ་པ། ངས་མ་ཐོས་སོ། །
en: “No, I didn’t hear it,” the Blessed One replied.

source: གསོལ་པ། ཅི་བཅོམ་ལྡན་འདས་གཟིམས་གཟིམས་སམ།
en: “How is that?” the man asked. “Was the Blessed One sleeping?”

source: བཀའ་སྩལ་པ། ང་ཅང་མ་ཉལ་ལོ། །
en: The Blessed One said, “No, I was not asleep at all.”

source: གསོལ་པ། ཅི་བཅོམ་ལྡན་འདས་འདུ་ཤེས་དང་ལྡན་བཞིན་ལ་མ་གཟིམས་བཞིན་དུ་འབྲུག་སྒྲ་དང་ཐོག་བབ་པའི་སྒྲ་མ་གསན་ཏམ།
en: “If the Blessed One has faculties of perception and wasn’t asleep,” he said, “then how did he not hear the thunder roar and the lightning strike?”

source: བཀའ་སྩལ་པ། འདུ་ཤེས་དང་ལྡན་བཞིན་ལ་མ་ཉལ་བཞིན་དུ་ངས་འབྲུག་སྒྲ་དང་ཐོག་བབ་པའི་སྒྲ་མ་ཐོས་སོ། །
en: “I have faculties of perception, and I was not sleeping,” the Blessed One replied, “but I did not hear the thunder roar nor the lightning strike.”

source: དེ་ནས་མི་དེས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Now the man had to think this over.

source: ཀྱེ་མ་འདི་ལྟར་འདུ་ཤེས་དང་ཡང་ལྡན་པ་ཞིག་ལ་གཟིམས་ཀྱང་མ་གཟིམས་པར་འབྲུག་སྒྲ་དང་ཐོག་བབ་པའི་སྒྲ་ཡང་མ་གསན་པ་ལས་ན།
en: “Hmm,” he thought, “although he has faculties of perception and was not sleeping, still he did not hear the thunder roar nor the lightning strike.

source: བཅོམ་ལྡན་འདས་གནས་པའི་བསམ་གཏན་དེ་དེ་ཙམ་དུ་ཞི་བ་ནི་ངོ་མཚར་ཏོ་སྙམ་ནས་མི་དེ་དགའ་བར་གྱུར་ཏེ།
en: How wonderful that the Blessed One can abide so peacefully in meditation.”

source: དགའ་བར་གྱུར་པའི་ཡོན་ཡང་ཕུལ་ལོ། །
en: This made the man very happy, and in his happiness he made offerings to the Blessed One.

source: དེའི་ཚེ་ཡུལ་ཨ་དུ་མའི་ནགས་ཁྲོད་ཅིག་ན་དྲང་སྲོང་ཀཻ་ནེ་ཡ་ཞེས་བྱ་བ་འཁོར་ལྔ་བརྒྱ་ཡོད་པ་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་ཞིག་གནས་སོ། །
en: At that time in the forests of the Adumā region there lived a certain sage named Kaineya who was clairvoyant and had a retinue of five hundred.

source: དེ་དང་ཐག་མི་རིང་བ་གུད་ཀྱི་ནགས་ཁྲོད་ཅིག་ན་ནི་དེ་ཉིད་ཀྱི་སྲིང་མོའི་བུ་དྲང་སྲོང་རི་བོ་ཞེས་བྱ་བ་འཁོར་ལྔ་བརྒྱ་ཡོད་པ་ཞིག་གནས་སོ། །
en: Not far away in another forest lived his sister’s son, a sage by the name of Śaila, who also had a retinue of five hundred.

source: དྲང་སྲོང་དེ་གཉི་ག་ཡང་མཚོ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་ན་གནས་ཏེ། དེ་གཉིས་དེར་དུས་དུས་སུ་འགྲོ་ཞིང་ཉིན་པར་གནས་པར་བྱེད་དོ། །
en: Both sages also spent time on the banks of Lake Mandākinī, traveling there now and again to spend the day.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ། འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་པ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ། ཡང་དག་པར་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི། ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: སུ་ནི་རྒུད་སུ་ནི་དར་སུ་ནི་ཕོངས་ཤིང་འདུག་སུ་ནི་ཉམ་ང་བར་གྱུར།
en: “Who is in decline? Who will flourish? Who is destitute? Who is in a dreadful state?

source: སུ་ནི་གནོད་པ་དང་ལྡན་སུ་ནི་ཕོངས་པ་དང་ཉམ་ང་བ་དང་གནོད་པ་དང་ལྡན།
en: Who is being harmed? Who is destitute, in a dreadful state, and being harmed?

source: སུ་ནི་ངན་སོང་དུ་གཞོལ།
en: Who is veering toward the lower realms?

source: སུ་ནི་སངས་རྒྱས་བྱུང་བས་བརྒྱན་པའི་འཇིག་རྟེན་འབྲས་བུ་དང་བཅས་པར་བྱ་སྙམ་དུ་ཡེ་ཤེས་གཟིགས་པ་འཇུག་གོ། །
en: For whom shall I cause this world, adorned with a buddha’s presence, to be fruitful?”
